Repository: jafar144/Ash-Story
Catalog: lib/l10n/app_*.arb
Languages: id

source: Login
id: Masuk

source: Register
id: Daftar

# labelFieldName
source: Name
id: Nama

# errorFieldName
source: Please enter name
id: Tolong masukkan nama

# errorFieldEmail1
source: Please enter email
id: Tolong masukkan email

# errorFieldEmail2
source: Enter valid email
id: Masukkan email yang valid

# errorFieldPassword1
source: Please enter password
id: Tolong masukkan password

# errorFieldPassword2
source: Must be at least 8 characters
id: Harus lebih dari 8 karakter

# labelFieldConfirmPassword
source: Confirm Password
id: Konfirmasi Password

# errorFieldConfirmPassword1
source: Please enter confirm password
id: Tolong masukkan konfirmasi password

# errorFieldConfirmPassword2
source: Password do not match
id: Password tidak sama

# messageSuccessDialogRegister
source: Success create new account!
id: Berhasil menambahkan akun baru!

source: Already have account?
id: Sudah punya akun?

# registerTextSection
source: Let's get started!
id: Ayo kita mulai!

# loginTextSection
source: Hello, Welcome Bace!
id: Halo, Selamat Datang!

source: Forgot Password?
id: Lupa password?

# haveAccount
source: Don't have account?
id: Belum punya akun?

source: Register here
id: Daftar sini

source: Add Story
id: Tambah story

source: Description
id: Deskripsi

# successAddStory
source: Horay, success add story!
id: Yeay, berhasil menambahkan story

# failedAddStory
source: Noo, failed to upload story
id: Yahh, gagal menambahkan story

source: Please add image!
id: Tolong tambahkan gambar dulu

source: Please add description
id: Tolong tambahkan deskripsi dulu

source: Success
id: Berhasil

source: Failed
id: Gagal

source: Cancel
id: Kembali

# differentDurationYear
source: {duration} years ago
id: {duration} tahun lalu

# differentDurationDays
source: {duration} days ago
id: {duration} hari lalu

# differentDurationHours
source: {duration} hours ago
id: {duration} jam lalu

# differentDurationMinutes
source: {duration} minutes ago
id: {duration} menit lalu

# differentDurationSeconds
source: {duration} seconds ago
id: {duration} detik lalu
